aroyer-qc/Digini/Peripheral/src/port/STM32F1xx/system_clock.c
//-------------------------------------------------------------------------------------------------
//
//  File : system_clock.c
//
//-------------------------------------------------------------------------------------------------
//
// Copyright(c) 2024 Alain Royer.
// Email: aroyer.qc@gmail.com
//
// Permission is hereby granted, free of charge, to any person obtaining a copy of this software
// and associated documentation files (the "Software"), to deal in the Software without
// restriction, including without limitation the rights to use, copy, modify, merge, publish,
// distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the
// Software is furnished to do so, subject to the following conditions:
//
// The above copyright notice and this permission notice shall be included in all copies or
// substantial portions of the Software.
//
// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED,
// INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE
// AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM,
// DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
// OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
//
//-------------------------------------------------------------------------------------------------

//-------------------------------------------------------------------------------------------------
// Include file(s)
//-------------------------------------------------------------------------------------------------

#define SYSTEM_GLOBAL
#include "system_clock.h"
#undef  SYSTEM_GLOBAL

//-------------------------------------------------------------------------------------------------
// Define(s)
//-------------------------------------------------------------------------------------------------

// Vector Table base offset field. This value must be a multiple of 0x200.
#define VECT_TAB_OFFSET     0x00

//-------------------------------------------------------------------------------------------------
// Variables(s)
//-------------------------------------------------------------------------------------------------

//-------------------------------------------------------------------------------------------------
//
//  Name:           SystemInit
//
//  Parameter(s):   None
//  Return:         None
//
//  Description:    Reset the CPU Setting
//                  Configures : Vector table relocation
//                               System clock source
//                               PLL Multiplier and Divider factors
//                               AHB/APBx prescalers and Flash settings
//
//  Note(s):        This function should be called only once the RCC clock configuration is reset
//                  to the default reset state (done in BSP_SystemReset function).
//
//-------------------------------------------------------------------------------------------------
void SystemInit(void)
{
    //uint32_t Retry;

    //__asm volatile("cpsid i");                                              // Disable IRQ

    //SET_BIT(RCC->APB2ENR, RCC_APB2ENR_SYSCFGEN);
    SET_BIT(RCC->APB1ENR, RCC_APB1ENR_PWREN);

    // Reset the RCC clock configuration to the default reset state ------------
    // Set HSION bit
    SET_BIT(RCC->CR, RCC_CR_HSION);

    // Set CFGR register
	//RCC->CFGR = (SYS_HCLK_CFG | SYS_APB1_CFG | SYS_APB2_CFG);

    // Reset HSEBYP, CSSON and PLLON bits
	//CLEAR_BIT(RCC->CR, (RCC_CR_CSSON | RCC_CR_PLLON | RCC_CR_HSEBYP));

  #if (SYS_CLOCK_MUX == CFG_RCC_CFGR_SW_PLL)

    SET_BIT(RCC->CR, RCC_CR_HSEON);

    // Wait for HSE to be ready B4 enabling PLL
    //Retry = 0;
    //while((READ_BIT(RCC->CR, RCC_CR_HSERDY) == 0) && (Retry < SYSTEM_CLOCK_NUMBER_OF_RETRY))
    //{
    //    Retry++;
    //};

    // If HSE not ready, will will switch to HSI
    //if(READ_BIT(RCC->CR, RCC_CR_HSERDY) == 0)
    //{
    //    CLEAR_BIT(RCC->CR, RCC_CR_HSEON);

        // Wait for HSI to be ready B4 enabling PLL
    //    while(READ_BIT(RCC->CR, RCC_CR_HSIRDY) == 0) {};

        // Set PLLCFGR register
    //    RCC->PLLCFGR = RCC_HSI_PLL_CFGR_CFG;

    //  #if (HSE_AND_HSI_MUST_BE_MATCHED == DEF_ENABLED)
        // Set a flag for main loop to signal HSE clock failure!
    //    SystemHSE_ClockFailure = true;
    //  #endif
    //}
    //else
    //{
        // Set PLLCFGR register
    //    RCC->PLLCFGR = RCC_HSE_PLL_CFGR_CFG;

        // Reset HSION bit to reduce consumption
    //    CLEAR_BIT(RCC->CR, RCC_CR_HSION);

    //  #if (HSE_AND_HSI_MUST_BE_MATCHED == DEF_ENABLED)
        // Set a flag for main loop signal HSE is OK!
    //    SystemHSE_ClockFailure = false;
    //  #endif
    //}

    // Enable Prefetch Buffer
    FLASH->ACR |= FLASH_ACR_PRFTBE;

    // Set flash latency
    MODIFY_REG(FLASH->ACR, FLASH_ACR_LATENCY, FLASH_LATENCY_CFG);

    // Enable PLL
    //SET_BIT(RCC->CR, RCC_CR_PLLON);

    // Wait for PLL to be ready B4 enabling PLL
    //while(READ_BIT(RCC->CR, RCC_CR_PLLRDY) == 0) {};

    // Switch to PLL
    //SET_BIT(RCC->CFGR, RCC_CFGR_SW_PLL);

  #endif // (SYS_CLOCK_MUX == CFG_RCC_CFGR_SW_PLL)

    // Disable and clear all interrupts
    //RCC->CIR = 0;

    // Configure the Vector Table location add offset address ------------------
  #ifdef VECT_TAB_SRAM
    SCB->VTOR = SRAM_BASE | VECT_TAB_OFFSET;    // Vector Table Relocation in Internal SRAM
  #else
    SCB->VTOR = FLASH_BASE | VECT_TAB_OFFSET;   // Vector Table Relocation in Internal FLASH
  #endif
}

//-------------------------------------------------------------------------------------------------


{
    // Set CFGR register
  #ifndef STM32F10X_CL
	RCC->CFGR = (SYS_HCLK_CFG | SYS_APB1_CFG | SYS_APB2_CFG);
    RCC->CFGR &= (uint32_t)0xF8FF0000;
  #else
    RCC->CFGR &= (uint32_t)0xF0FF0000;
	RCC->CFGR = (SYS_HCLK_CFG | SYS_APB1_CFG | SYS_APB2_CFG);
  #endif
  
  /* Reset HSEON, CSSON and PLLON bits */
  RCC->CR &= (uint32_t)0xFEF6FFFF;

  /* Reset HSEBYP bit */
  RCC->CR &= (uint32_t)0xFFFBFFFF;

  /* Reset PLLSRC, PLLXTPRE, PLLMUL and USBPRE/OTGFSPRE bits */
  RCC->CFGR &= (uint32_t)0xFF80FFFF;

  /* Reset PLL2ON and PLL3ON bits */
#ifdef STM32F10X_CL
  RCC->CR &= (uint32_t)0xEBFFFFFF;
#endif /* STM32F10X_CL */


  /* Disable all interrupts and clear pending bits  */
#ifdef STM32F10X_CL
  RCC->CIR = 0x00FF0000;
#else
  RCC->CIR = 0x009F0000;
#endif /* STM32F10X_CL */


  /* Reset CFGR2 register */
#if defined (STM32F10X_CL) || defined (STM32F10X_LD_VL) || defined (STM32F10X_MD_VL) || (defined STM32F10X_HD_VL)
  RCC->CFGR2 = 0x00000000;      
#else
#endif /* STM32F10X_CL */
    

  /* Configure the System clock frequency, HCLK, PCLK2 and PCLK1 prescalers */
  /* Configure the Flash Latency cycles and enable prefetch buffer */
  SetSysClock();
}


